read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_aligner.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_alu.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_bufreg.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_bufreg2.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_compdec.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_csr.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_ctrl.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_debug.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_decode.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_immdec.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_mem_if.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_rf_if.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_rf_ram.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_rf_ram_if.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_rf_top.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_state.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_synth_wrapper.v
read_verilog -sv REPO_ROOT/block4_builds/serv/rtl/serv_top.v
hierarchy -top serv_synth_wrapper
synth_ecp5 -top serv_synth_wrapper -json REPO_ROOT/block4_builds/serv/ecp5/serv_ecp5.json
stat
